[
  {
    "id": 1,
    "title": "Why Invest in Lagos Real Estate in 2024",
    "excerpt": "Lagos continues to be Nigeria's economic hub with massive growth potential. Discover the key reasons why real estate investment in Lagos is your best bet for wealth creation.",
    "body": "Lagos, as Nigeria's economic powerhouse, offers investors unmatched opportunities in real estate. With rapid urbanization, infrastructural development, and population growth, property values continue to appreciate year after year. In 2024, government-backed housing projects, improved transport networks such as the Blue Rail Line, and growing demand from young professionals are driving the market. Investors who buy into strategic locations like Lekki, Ikoyi, and Victoria Island stand to gain strong returns on both rentals and resale values.",
    "image": "https://images.pexels.com/photos/323780/pexels-photo-323780.jpeg?auto=compress&cs=tinysrgb&w=800",
    "author": "Adebayo Ogundimu",
    "date": "January 15, 2024",
    "readTime": "5 min read",
    "category": "Investment"
  },
  {
    "id": 2,
    "title": "Complete Guide to Buying Land in Nigeria",
    "excerpt": "Navigate the complexities of land purchase in Nigeria with our comprehensive guide. Learn about documentation, due diligence, and common pitfalls to avoid.",
    "body": "Buying land in Nigeria can be rewarding but requires careful due diligence. Before making a purchase, confirm the authenticity of documents such as the Certificate of Occupancy (C of O), Gazette, or Deed of Assignment. Always conduct a proper land search at the relevant land registry to avoid 'Omonile' scams. Ensure survey plans are genuine, and verify if the land is free from government acquisition. Engaging a trusted lawyer throughout the process is critical for safe transactions.",
    "image": "https://images.pexels.com/photos/1396122/pexels-photo-1396122.jpeg?auto=compress&cs=tinysrgb&w=800",
    "author": "Kemi Okafor",
    "date": "January 12, 2024",
    "readTime": "8 min read",
    "category": "Guide"
  },
  {
    "id": 3,
    "title": "Lekki vs Ikoyi: Where Should You Buy Property?",
    "excerpt": "Compare two of Lagos' most prestigious areas. We analyze prices, infrastructure, appreciation potential, and lifestyle factors to help you make the right choice.",
    "body": "Lekki and Ikoyi are two prime real estate hotspots in Lagos, but they cater to different markets. Ikoyi is traditionally more upscale, with premium luxury apartments, diplomatic presence, and established infrastructure. However, Lekki offers faster growth potential with emerging developments, modern estates, and relative affordability compared to Ikoyi. If you're seeking long-term capital appreciation, Lekki may be more attractive, while Ikoyi remains the choice for prestige and high-end living.",
    "image": "https://images.pexels.com/photos/280229/pexels-photo-280229.jpeg?auto=compress&cs=tinysrgb&w=800",
    "author": "Funmi Adebayo",
    "date": "January 10, 2024",
    "readTime": "6 min read",
    "category": "Location Guide"
  },
  {
    "id": 4,
    "title": "10 Red Flags When Buying Property in Nigeria",
    "excerpt": "Protect yourself from property fraud and bad investments. Learn to identify warning signs and due diligence steps that could save you millions.",
    "image": "https://images.pexels.com/photos/1571460/pexels-photo-1571460.jpeg?auto=compress&cs=tinysrgb&w=800",
    "author": "Tunde Bakare",
    "date": "January 8, 2024",
    "readTime": "7 min read",
    "category": "Tips"
  },
  {
    "id": 5,
    "title": "Understanding Certificate of Occupancy (C of O)",
    "excerpt": "Everything you need to know about C of O - the most important property document in Nigeria. Learn the application process, costs, and timeline.",
    "image": "https://images.pexels.com/photos/259588/pexels-photo-259588.jpeg?auto=compress&cs=tinysrgb&w=800",
    "author": "Kemi Okafor",
    "date": "January 5, 2024",
    "readTime": "10 min read",
    "category": "Legal"
  },
  {
    "id": 6,
    "title": "Property Investment Strategies for Young Professionals",
    "excerpt": "Start building wealth through real estate even with a modest income. Discover practical strategies and financing options for young professionals.",
    "image": "https://images.pexels.com/photos/1396132/pexels-photo-1396132.jpeg?auto=compress&cs=tinysrgb&w=800",
    "author": "Adebayo Ogundimu",
    "date": "January 3, 2024",
    "readTime": "6 min read",
    "category": "Investment"
  }
]
